test/resources/9999999/dataExtension/update-callout-afterCreatedViaEvent-expected.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><Body><UpdateRequest xmlns="http://exacttarget.com/wsdl/partnerAPI"><Objects xsi:type="DataExtension"><CreatedDate>2024-07-05T08:01:54.803</CreatedDate><ModifiedDate>2024-07-05T08:01:58.923</ModifiedDate><ObjectID>4342972c-a43c-ef11-a5c8-5cba2c702db8</ObjectID><CustomerKey>testNew_event_withSchema</CustomerKey><Name>testNew_event_withSchema</Name><Description></Description><IsSendable>true</IsSendable><IsTestable>false</IsTestable><SendableDataExtensionField><ObjectID></ObjectID><Name>ContactId</Name></SendableDataExtensionField><SendableSubscriberField><Name>_SubscriberKey</Name></SendableSubscriberField><RowBasedRetention>false</RowBasedRetention><ResetRetentionPeriodOnImport>false</ResetRetentionPeriodOnImport><DeleteAtEndOfRetentionPeriod>false</DeleteAtEndOfRetentionPeriod><RetainUntil></RetainUntil><CategoryID>2</CategoryID></Objects></UpdateRequest></Body><Header><fueloauth xmlns="http://exacttarget.com">9999999</fueloauth></Header></Envelope>